InformationRegisters/DMS_МенеджерКупонов_РегистрацияПредложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_МенеджерКупонов_РегистрацияПредложений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбращениеВСервис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_МенеджерКупонов_ПроверкаПромокодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_МенеджерКупонов_ПроверкаПромокодов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DMS_МенеджерКупоновАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_МенеджерКупоновАкции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>number</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>expired_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>multiple_select</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>referances</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Референс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_МенеджерКупоновРеференс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/DMS_МенеджерКупонов/Ext/Module.bsl
Процедура ОбновитьТокенДоступа() экспорт

	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];	
	
	если НЕ (ЗначениеЗаполнено(Настройки) И ЗначениеЗаполнено(Настройки.МенеджерКупонов_host)) тогда
		Возврат;
	КонецЕсли;
		
	Соединение = Новый HTTPСоединение(Настройки.МенеджерКупонов_host,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Запрос = Новый HTTPЗапрос("/oauth/v2/token"
								+ "?client_id=" + Настройки.МенеджерКупонов_client_id
								+ "&client_secret=" + Настройки.МенеджерКупонов_client_secret
								+ "&grant_type=password"
								+ "&username=" + Настройки.МенеджерКупонов_login
								+ "&password=" + Настройки.МенеджерКупонов_passwd);
								
	попытка 
		РезультатЗапроса = Соединение.Получить(Запрос);
	исключение
		ЗаписьЖурналаРегистрации("МенеджерКупонов",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Сообщить("Получение токена не удалось");
		Возврат;
	КонецПопытки;
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Результат = РезультатЗапроса.ПолучитьТелоКакСтроку();	
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Результат);
		Соответствие = ПрочитатьJSON(Чтение, Истина);
		
		Константы.DMS_МенеджерКупонов_access_token.Установить(Соответствие["access_token"]); 
		Константы.DMS_МенеджерКупонов_refresh_token.Установить(Соответствие["refresh_token"]);
		Константы.DMS_МенеджерКупонов_ДатаДействияТокена.Установить(ТекущаяДата() + Соответствие["expires_in"])	
	иначе
		ЗаписьЖурналаРегистрации("МенеджерКупонов.ПолучениеТокена",УровеньЖурналаРегистрации.Ошибка,,,РезультатЗапроса.ПолучитьТелоКакСтроку());
		Сообщить("Получение токена не удалось");
	КонецЕсли;


КонецПроцедуры  

процедура ЗагрузитьАкцииВБазу(ОбновитьТокен = ЛОЖЬ) экспорт
	
	ТокенПросрочен = Константы.DMS_МенеджерКупонов_ДатаДействияТокена.Получить() < ТекущаяДата();
	ОбновитьТокен = ОбновитьТокен ИЛИ ТокенПросрочен;
	
	Если ОбновитьТокен тогда
		ОбновитьТокенДоступа();
	КонецЕсли;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];	
	Токен = Константы.DMS_МенеджерКупонов_access_token.Получить();
		
	Соединение = Новый HTTPСоединение(Настройки.МенеджерКупонов_host,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Запрос = Новый HTTPЗапрос("/api/offer/list",Заголовки);
	
	попытка 
		РезультатЗапроса = Соединение.Получить(Запрос);
			
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			
			Результат = РезультатЗапроса.ПолучитьТелоКакСтроку();	

			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Результат);
			МассивАкций = ПрочитатьJSON(Чтение, Истина, "expired_date");
			
			МассивID = Новый Массив;
			
			Для каждого элемент из МассивАкций цикл
				МассивID.Добавить(элемент["id"]);
				АкцияСсылка = Справочники.DMS_МенеджерКупоновАкции.НайтиПоРеквизиту("id",элемент["id"]); 
				
				Если ЗначениеЗаполнено(АкцияСсылка) тогда
					АкцияОбъект = АкцияСсылка.ПолучитьОбъект();
				иначе
					АкцияОбъект = Справочники.DMS_МенеджерКупоновАкции.СоздатьГруппу();
				КонецЕсли;
				
				АкцияОбъект.id = элемент["id"];
				АкцияОбъект.number = элемент["number"];
				АкцияОбъект.expired_date = элемент["expired_date"];
				АкцияОбъект.Наименование = элемент["name"];
				АкцияОбъект.ПометкаУдаления = не элемент["isActive"]; 
				АкцияОбъект.Записать();
				
				Для Каждого подакция из элемент["sub_offers"] цикл
					
					ПодакцияСсылка = Справочники.DMS_МенеджерКупоновАкции.НайтиПоРеквизиту("id",подакция["id"]);
					
					Если ЗначениеЗаполнено(ПодакцияСсылка) тогда
						ПодакцияОбъект = ПодакцияСсылка.ПолучитьОбъект();
					иначе
						ПодакцияОбъект = Справочники.DMS_МенеджерКупоновАкции.СоздатьЭлемент();
					КонецЕсли;
					
					ПодакцияОбъект.Родитель = АкцияОбъект.Ссылка;
					ПодакцияОбъект.Наименование = подакция["name"]; 
					ПодакцияОбъект.id = подакция["id"]; 
					ПодакцияОбъект.multiple_select = подакция["multiple_select"];
					ПодакцияОбъект.referances.Очистить();	
					
					для Каждого референс из подакция["references"] цикл
						
						РеференсСсылка = Справочники.DMS_МенеджерКупоновРеференс.НайтиПоРеквизиту("id",референс["id"]);
						
						Если ЗначениеЗаполнено(РеференсСсылка) тогда
							РеференсОбъект = РеференсСсылка.ПолучитьОбъект();
						иначе
							РеференсОбъект = Справочники.DMS_МенеджерКупоновРеференс.СоздатьЭлемент();
						КонецЕсли;

						
						РеференсОбъект.id = референс["id"];
						РеференсОбъект.Наименование = референс["name"];
						РеференсОбъект.Записать();
						
						СтрокаРеференс = ПодакцияОбъект.referances.Добавить();
						СтрокаРеференс.Референс = РеференсОбъект.Ссылка;
						
						
					КонецЦикла;	
					
					ПодакцияОбъект.Записать();
					
				КонецЦикла;			
				
			КонецЦикла;		
			
		ИначеЕсли РезультатЗапроса.КодСостояния = 401 И НЕ ОбновитьТокен тогда // если токен невалиден попробуем загрузить еще раз с запросом нового
			ЗагрузитьАкцииВБазу(ИСТИНА);	
		иначе
			ВызватьИсключение РезультатЗапроса.ПолучитьТелоКакСтроку();	
		КонецЕсли;
		
	исключение
		ЗаписьЖурналаРегистрации("МенеджерКупонов",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Сообщить("Получение акций не удалось");
		Возврат;
	КонецПопытки;
	
	Константы.DMS_МенеджерКупонов_ДатаОбновленияАкций.Установить(ТекущаяДата());
	
КонецПроцедуры

процедура ДобавитьЗаказНарядыВОчередьОтправки(ЗаказНаряд = неопределено, ПовторнаяОтправка = ложь) экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект КАК Объект,
	               |	КонтактнаяИнформация.Тип КАК Тип,
	               |	МАКСИМУМ(КонтактнаяИнформация.Представление) КАК Представление
	               |ПОМЕСТИТЬ КонтактнаяИнформация
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Тип
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказНарядТаблица.Ссылка КАК СсылкаЗН,
	               |	ЗаказНарядТаблица.Дата КАК ДатаЗакрытия,    
	               |	ЗаказНарядТаблица.Номер КАК Номер,
	               |	Renault_CRM_ОбращениеВАвтоСервис.Ссылка КАК СсылкаОбращение,
	               |	Renault_CRM_ОбращениеВАвтоСервис.Менеджер КАК Менеджер,
	               |	ЕСТЬNULL(ЗаказНарядТаблица.Автомобиль.VIN, """") КАК АвтомобильVIN,
	               |	ЕСТЬNULL(ЗаказНарядТаблица.Автомобиль.ГодВыпуска, """") КАК АвтомобильГодВыпуска,
	               |	ЕСТЬNULL(ЗаказНарядТаблица.Автомобиль.Модель.Наименование, """") КАК АвтомобильМодельНаименование,
	               |	ЕСТЬNULL(ЗаказНарядТаблица.Автомобиль.Модель.Артикул, """") КАК АвтомобильМодельАртикул,
	               |	ЕСТЬNULL(Renault_CRM_ОбращениеВАвтоСервис.Клиент.НаименованиеПолное, """") КАК КлиентНаименованиеПолное,
	               |	ЕСТЬNULL(КонтактнаяИнформацияЕмейл.Представление, """") КАК Емейл,
	               |	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
	               |	Renault_CRM_ОбращениеВАвтоСервис.Клиент КАК Клиент,
	               |	Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_Реферансы.(
	               |		Референс.id КАК id,
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Референс КАК Референс
	               |	) КАК МенеджерКупонов_Реферансы,
	               |	ЕСТЬNULL(Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_Акция.number, 0) КАК МенеджерКупонов_Акция,
	               |	Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_Промокод КАК МенеджерКупонов_Промокод,
	               |	ЕСТЬNULL(Renault_CRM_ОбращениеВАвтоСервис.ДилерскийЦентр.BIR, """") КАК ДилерскийЦентрBIR,
	               |	ЕСТЬNULL(ЕСТЬNULL(Renault_CRM_ОбращениеВАвтоСервис.Автор.Наименование, ЗаказНарядТаблица.Автор.Наименование), """") КАК МенеджерНаименование,
	               |	DMS_МенеджерКупонов_РегистрацияПредложенийСрезПоследних.Период КАК ПериодПоследнейОтправки,
	               |	ЕСТЬNULL(Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_Подакция.id, 0) КАК МенеджерКупонов_Подакция,
	               |	ВЫБОР
	               |		КОГДА Renault_CRM_ОбращениеВАвтоСервис.Клиент.СогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК СогласиеОПД,
	               |	Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_ПримененПромокод КАК МенеджерКупонов_ПримененПромокод
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНарядТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ОбращениеВАвтоСервис КАК Renault_CRM_ОбращениеВАвтоСервис
	               |				ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформацияЕмейл
	               |				ПО Renault_CRM_ОбращениеВАвтоСервис.Клиент = КонтактнаяИнформацияЕмейл.Объект
	               |					И (КонтактнаяИнформацияЕмейл.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |			ПО Renault_CRM_ЗаявкаНаСервис.Обращение = Renault_CRM_ОбращениеВАвтоСервис.Ссылка
	               |		ПО (Renault_CRM_ЗаявкаНаСервис.ЗаказНаряд = ЗаказНарядТаблица.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	               |		ПО (Renault_CRM_ОбращениеВАвтоСервис.Клиент = КонтактнаяИнформацияТелефон.Объект)
	               |			И (КонтактнаяИнформацияТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DMS_МенеджерКупонов_РегистрацияПредложений.СрезПоследних КАК DMS_МенеджерКупонов_РегистрацияПредложенийСрезПоследних
	               |		ПО (DMS_МенеджерКупонов_РегистрацияПредложенийСрезПоследних.ЗаказНаряд = ЗаказНарядТаблица.Ссылка)
	               |ГДЕ
	               |	(DMS_МенеджерКупонов_РегистрацияПредложенийСрезПоследних.Период ЕСТЬ NULL
	               |			ИЛИ &ПовторнаяОтправка)
	               |	И (НЕ Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_Акция.Ссылка ЕСТЬ NULL
	               |			ИЛИ Renault_CRM_ОбращениеВАвтоСервис.МенеджерКупонов_ПримененПромокод = ИСТИНА)
	               |	И (ЗаказНарядТаблица.Ссылка = &Ссылка
	               |			ИЛИ &Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка))";
	

	запрос.УстановитьПараметр("Ссылка",?(ЗначениеЗаполнено(ЗаказНаряд), ЗаказНаряд, Документы.ЗаказНаряд.ПустаяСсылка()));
	запрос.УстановитьПараметр("ПовторнаяОтправка",ПовторнаяОтправка);
	
	выборка = Запрос.Выполнить().Выбрать();
	
	пока выборка.Следующий() цикл
		
		если НЕ ПовторнаяОтправка и ЗначениеЗаполнено(выборка.ПериодПоследнейОтправки) тогда
			Продолжить;			
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.DMS_МенеджерКупонов_РегистрацияПредложений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.ОбращениеВСервис = выборка.СсылкаОбращение;
		МенеджерЗаписи.Запрос = СформироватьJSONРегистрацииПредложения(выборка); 
		МенеджерЗаписи.ЗаказНаряд = выборка.СсылкаЗН;
		МенеджерЗаписи.Записать();
		
		
	КонецЦикла;



КонецПроцедуры

функция СформироватьJSONРегистрацииПредложения(выборка)
	
	Структура = Новый Структура;
	
	Телефон = РегистрыСведений.Renault_НормализованныеКонтактыДляПоиска.НормализоватьНомерТелефона(выборка.Телефон);
	
	Если ЗначениеЗаполнено(Телефон) тогда
		Телефон = "7" + Телефон; 
	КонецЕсли;

	
	если ЗначениеЗаполнено(выборка.МенеджерКупонов_Промокод) тогда
		Структура.Вставить("coupon", новый Структура("code", выборка.МенеджерКупонов_Промокод));
	КонецЕсли;
	
	Структура.Вставить("dealer", Новый Структура("bir,employee", выборка.ДилерскийЦентрBIR, СокрЛП(выборка.МенеджерНаименование)));
	
	СтруктураАвто = Новый Структура;
	СтруктураАвто.Вставить("vin", выборка.АвтомобильVIN);
	СтруктураАвто.Вставить("year", Год(выборка.АвтомобильГодВыпуска));
	СтруктураАвто.Вставить("model", выборка.АвтомобильМодельНаименование);
	СтруктураАвто.Вставить("model_code", выборка.АвтомобильМодельАртикул);
	Структура.Вставить("vehicle", СтруктураАвто);
	
	Если выборка.МенеджерКупонов_ПримененПромокод тогда
		СтруктураПромокод = Новый Структура;
		СтруктураПромокод.Вставить("code", выборка.МенеджерКупонов_Промокод);
		Структура.Вставить("coupon", СтруктураПромокод);
	иначе
		
		СтруктураОффер = Новый Структура;
		//СтруктураОффер.Вставить("number", ?(ЗначениеЗаполнено(выборка.МенеджерКупонов_Подакция), выборка.МенеджерКупонов_Подакция, выборка.МенеджерКупонов_Акция));
		СтруктураОффер.Вставить("number", выборка.МенеджерКупонов_Акция);
		МассивРеференсы = Новый массив;
		выборкаРеференсы = выборка.МенеджерКупонов_Реферансы.Выбрать();
		
		пока выборкаРеференсы.Следующий() цикл	
			МассивРеференсы.Добавить(выборкаРеференсы.id);	
		КонецЦикла;
		
		СтруктураОффер.Вставить("references", МассивРеференсы);
		Структура.Вставить("offer", СтруктураОффер);
		
	КонецЕсли;

	СтруктураЗаказНаряд = Новый Структура;
	СтруктураЗаказНаряд.Вставить("number", выборка.Номер);
	СтруктураЗаказНаряд.Вставить("date", выборка.ДатаЗакрытия);
	Структура.Вставить("work_order", СтруктураЗаказНаряд);
	
	СтруктураКлиента = новый Структура;
	СтруктураКлиента.Вставить("name",СокрЛП(выборка.КлиентНаименованиеПолное));
	СтруктураКлиента.Вставить("email",выборка.Емейл);
	СтруктураКлиента.Вставить("phone",Телефон);
	СтруктураКлиента.Вставить("processingPersonalData",выборка.СогласиеОПД);
	Структура.Вставить("client", СтруктураКлиента);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(новый ПараметрыЗаписиJSON(,Символы.Таб));
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	ЗаписатьJSON(ЗаписьJSON,Структура,НастройкиСериализации);
	
	
	возврат ЗаписьJSON.Закрыть();
	
	
КонецФункции

функция СформироватьJSONПроверкаПромокода(Промокод, VIN, Email = "", Телефон = "")
	
	Структура = Новый Структура;
	
	Телефон = РегистрыСведений.Renault_НормализованныеКонтактыДляПоиска.НормализоватьНомерТелефона(Телефон);
	
	Если ЗначениеЗаполнено(Телефон) тогда
		Телефон = "7" + Телефон; 
	КонецЕсли;

	
	Структура.Вставить("code", Промокод);
	Структура.Вставить("vin", VIN); 
	
	Структура.Вставить("email", ?(ЗначениеЗаполнено(Email), Email, ""));
	Структура.Вставить("phone", ?(ЗначениеЗаполнено(Телефон), Телефон, ""));

	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(новый ПараметрыЗаписиJSON(,Символы.Таб));
	
	//НастройкиСериализации = Новый НастройкиСериализацииJSON;
	//НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	//НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	ЗаписатьJSON(ЗаписьJSON,Структура);
	
	
	возврат ЗаписьJSON.Закрыть();
	
	
КонецФункции

Процедура ВыполнитьРегистрациюПредложенийВМенеджереКупонов() экспорт  
	
	запрос = Новый запрос;
	запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	РегистрСведений.DMS_МенеджерКупонов_РегистрацияПредложений.СрезПоследних КАК DMS_МенеджерКупонов_РегистрацияПредложенийСрезПоследних
	               |ГДЕ
	               |	DMS_МенеджерКупонов_РегистрацияПредложенийСрезПоследних.Отправлен = ЛОЖЬ";
	
	
	выборка = запрос.Выполнить().Выбрать();
	
	пока выборка.Следующий() цикл
		
			
		Результат = ОтправитьЗапросРегистрацияПредложения(выборка.Запрос);
		
		Если Результат <> Неопределено тогда
						
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Результат);
			Ответ = ПрочитатьJSON(Чтение, Истина, "datetime");
			
			МенеджерЗаписи = РегистрыСведений.DMS_МенеджерКупонов_РегистрацияПредложений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, выборка);
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() тогда
				МенеджерЗаписи.Отправлен = ИСТИНА;
				МенеджерЗаписи.Ответ = Результат;
				МенеджерЗаписи.ТекстОшибки = "";
				если Ответ["error"] <> Неопределено тогда
					МенеджерЗаписи.ТекстОшибки = ?(ЗначениеЗаполнено(МенеджерЗаписи.ТекстОшибки), МенеджерЗаписи.ТекстОшибки + ";", "") + Ответ["error"]["message"];
				Конецесли;
				МенеджерЗаписи.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;



КонецПроцедуры

Функция ОтправитьЗапросРегистрацияПредложения(ТелоЗапроса, ОбновитьТокен = ЛОЖЬ)

   	ТокенПросрочен = Константы.DMS_МенеджерКупонов_ДатаДействияТокена.Получить() < ТекущаяДата();
	ОбновитьТокен = ОбновитьТокен ИЛИ ТокенПросрочен;
	
	Если ОбновитьТокен тогда
		ОбновитьТокенДоступа();
	КонецЕсли;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];	
	Токен = Константы.DMS_МенеджерКупонов_access_token.Получить();
		
	Соединение = Новый HTTPСоединение(Настройки.МенеджерКупонов_host,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Запрос = Новый HTTPЗапрос("/api/offer/registration",Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	попытка 
		РезультатЗапроса = Соединение.ОтправитьДляОбработки(Запрос);
			
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			
			Результат = РезультатЗапроса.ПолучитьТелоКакСтроку();	

			Возврат Результат;
						
		ИначеЕсли РезультатЗапроса.КодСостояния = 401 И НЕ ОбновитьТокен тогда // если токен невалиден попробуем загрузить еще раз с запросом нового
			возврат ОтправитьЗапросРегистрацияПредложения(ИСТИНА);	
		иначе
			ВызватьИсключение РезультатЗапроса.ПолучитьТелоКакСтроку();	
		КонецЕсли;
		
	исключение
		ЗаписьЖурналаРегистрации("МенеджерКупонов",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Сообщить("Регистрация предложения не удалась");
		Возврат неопределено;
	КонецПопытки;

КонецФункции

Функция ОтправитьЗапросПроверкаПромокода(Промокод, VIN, Email = неопределено, Телефон = неопределено, ОбновитьТокен = ЛОЖЬ) экспорт

	СтруктураРезультат = Новый Структура;
	
	ТокенПросрочен = Константы.DMS_МенеджерКупонов_ДатаДействияТокена.Получить() < ТекущаяДата();
	ОбновитьТокен = ОбновитьТокен ИЛИ ТокенПросрочен;
	
	Если ОбновитьТокен тогда
		ОбновитьТокенДоступа();
	КонецЕсли;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];	
	Токен = Константы.DMS_МенеджерКупонов_access_token.Получить();
		
	Соединение = Новый HTTPСоединение(Настройки.МенеджерКупонов_host,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	//Запрос = Новый HTTPЗапрос("/api/offer/coupon_check"
	//+ "?code=" + Промокод
	//+ "&vin=" + VIN
	//+ ?(ЗначениеЗаполнено(Email), "&email=" + Email, "")
	//+ ?(ЗначениеЗаполнено(Телефон), "&phone=" + Телефон, ""), Заголовки);
	Запрос = Новый HTTPЗапрос("/api/offer/coupon_check", Заголовки);
	ТелоЗапроса = СформироватьJSONПроверкаПромокода(Промокод, VIN, Email, Телефон);
	запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	попытка 
		РезультатЗапроса = Соединение.ОтправитьДляОбработки(Запрос);
			
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			
			Результат = РезультатЗапроса.ПолучитьТелоКакСтроку();	
			
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Результат);
			Ответ = ПрочитатьJSON(Чтение, Истина, "datetime");
	
			МенеджерЗаписи = РегистрыСведений.DMS_МенеджерКупонов_ПроверкаПромокодов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Промокод = Промокод;
			МенеджерЗаписи.Запрос = ТелоЗапроса;
			МенеджерЗаписи.Ответ = Результат; 
			
			если Ответ["error"] <> Неопределено тогда
				МенеджерЗаписи.ТекстОшибки = Ответ["error"]["message"];
				СтруктураРезультат.Вставить("ТекстОшибки", Ответ["error"]["message"]); 
			Конецесли;
			если Ответ.Получить("description") <> Неопределено тогда
				МенеджерЗаписи.Описание = Ответ["description"];
				СтруктураРезультат.Вставить("Описание", Ответ["description"]);
			Конецесли;
			
			МенеджерЗаписи.Записать();
			
			Возврат СтруктураРезультат;
						
		ИначеЕсли РезультатЗапроса.КодСостояния = 401 И НЕ ОбновитьТокен тогда // если токен невалиден попробуем загрузить еще раз с запросом нового
			возврат ОтправитьЗапросПроверкаПромокода(Промокод, VIN, Email, Телефон, ИСТИНА);	
		иначе
			ВызватьИсключение РезультатЗапроса.ПолучитьТелоКакСтроку();	
		КонецЕсли;
		
	исключение
		ЗаписьЖурналаРегистрации("МенеджерКупонов",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Сообщить("Регистрация предложения не удалась");
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Процедура DMS_МенеджерКупоновРегЗадание() Экспорт
	ЗагрузитьАкцииВБазу();
	ДобавитьЗаказНарядыВОчередьОтправки();
	ВыполнитьРегистрациюПредложенийВМенеджереКупонов();
КонецПроцедуры

Процедура ЗапуститьФоновоеЗаданиеРегистрацииПредложения() экспорт
	
	ФоновыеЗадания.Выполнить("DMS_МенеджерКупонов.ВыполнитьРегистрациюПредложенийВМенеджереКупонов",,,"Регистрация предложений в менеджере купонов");

КонецПроцедуры
